ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Comment>Трейд Софт</Comment>
			<Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
				<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
				<v8:Type>cfg:DocumentRef.РеструктуризацияМикрозайма</v8:Type>
				<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
				<v8:Type>cfg:CatalogRef.Судьи</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
				<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
				<v8:Type>cfg:CatalogRef.СудебныеУчастки</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.тсЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Банки</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
				<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКонтрагентовУЭД</v8:Type>
				<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
				<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
				<v8:Type>cfg:DocumentRef.ДоговорМикрозайма</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
				<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>6</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТипаСтрока</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочникВладелец</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемоеЗначение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователейДоступность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДоступныхЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/Forms/ФормаВыбораГруппы/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	////Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
	////	Если ВладелецФормы.ТекущаяСтрока.ЭтоГруппа Тогда
	////		Если Не (Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_ДолговыеОбязательства") ИЛИ 
	////				Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеСведения_Контрагенты")) Тогда
	////			СтандартнаяОбработка = Ложь;
	////			Сообщить("Перемещение недопустимо!");
	////		КонецЕсли;
	////	ИначеЕсли Не (Не Значение.Предопределенный ИЛИ 
	////			Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_ДолговыеОбязательства") ИЛИ 
	////			Значение = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныеРеквизиты_Контрагенты")) Тогда		
	////		СтандартнаяОбработка = Ложь;
	////		Сообщить("Нельзя перемещать элементы в предопределенные группы!");
	////	КонецЕсли;	
	////КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	////Попытка
	////	Если ВладелецФормы.Родитель.ИмяФормы = "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента" Тогда
	////		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	////		УстановитьОтбор("Родитель", ВладелецФормы.Родитель.ТипЭлемента);
	////	КонецЕсли;
	////Исключение
	////КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(Поле, Значение)
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);	
	Для Каждого ЭлементОтбораСобытий Из Список.Отбор.Элементы Цикл		
		Если ЭлементОтбораСобытий.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбораСобытий.ПравоеЗначение = Значение;
			ЭлементОтбораСобытий.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВниз(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Список.ТекущаяСтрока, Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВверх(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Список.ТекущаяСтрока, Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПереместитьКатегориюВверхВниз(ТекущаяСтрока, ПереместитьВверх)
	ПорядковыйНомер = ТекущаяСтрока.ПорядковыйНомер;	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	                      |ГДЕ
	                      |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПорядковыйНомер УБЫВ");
	Запрос.УстановитьПараметр("Родитель", ТекущаяСтрока.Родитель);
	Результат = Запрос.Выполнить().Выбрать();
	Если Не Результат.Следующий() Тогда
		Возврат;
	КонецЕсли;
	МаксимальныйНомер = Результат.ПорядковыйНомер;
	
	Если Не ((ПереместитьВверх И ПорядковыйНомер > 1) ИЛИ (Не ПереместитьВверх И ПорядковыйНомер < МаксимальныйНомер)) Тогда	
		Возврат;
	КонецЕсли;
		
	Если ПереместитьВверх Тогда	
	    ПорядковыйНомер2 = ПорядковыйНомер - 1;
	Иначе
		ПорядковыйНомер2 = ПорядковыйНомер + 1;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	Запрос.УстановитьПараметр("ПорядковыйНомер2", ПорядковыйНомер2);		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.ПорядковыйНомер КАК ПорядковыйНомер,
	               |	ДополнительныеРеквизитыИСведения.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер
	               |			ТОГДА &ПорядковыйНомер2
	               |		ИНАЧЕ &ПорядковыйНомер
	               |	КОНЕЦ КАК ПорядковыйНомерНовый
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Родитель = &Родитель
	               |	И (ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер
	               |			ИЛИ ДополнительныеРеквизитыИСведения.ПорядковыйНомер = &ПорядковыйНомер2)";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл;
		ЭлементОбъект = Результат.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ПорядковыйНомер = Результат.ПорядковыйНомерНовый;
		ЭлементОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
